{"pageProps":{"post":{"title":"Challenges I have faced learning React","date":"2020-07-04","slug":"2020-07-04","mdxSource":{"compiledSource":"var p=Object.defineProperty,u=Object.defineProperties;var c=Object.getOwnPropertyDescriptors;var s=Object.getOwnPropertySymbols;var r=Object.prototype.hasOwnProperty,i=Object.prototype.propertyIsEnumerable;var l=(e,t,a)=>t in e?p(e,t,{enumerable:!0,configurable:!0,writable:!0,value:a}):e[t]=a,o=(e,t)=>{for(var a in t||(t={}))r.call(t,a)&&l(e,a,t[a]);if(s)for(var a of s(t))i.call(t,a)&&l(e,a,t[a]);return e},h=(e,t)=>u(e,c(t));var d=(e,t)=>{var a={};for(var n in e)r.call(e,n)&&t.indexOf(n)<0&&(a[n]=e[n]);if(e!=null&&s)for(var n of s(e))t.indexOf(n)<0&&i.call(e,n)&&(a[n]=e[n]);return a};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(a){var n=a,{components:e}=n,t=d(n,[\"components\"]);return mdx(MDXLayout,h(o(o({},layoutProps),t),{components:e,mdxType:\"MDXLayout\"}),mdx(\"p\",null,`Learning React was a big challenge for me. I started learning React in earnest\nin 2019. It was a difficult experience overall, but I wanted to go over my\nlearning experience`),mdx(\"p\",null,\"If I were to take away anything from this\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},`pair programming was really useful especially as a remote worker, I had\nnothing before that except weekly standups where I felt really depressed`),mdx(\"li\",{parentName:\"ul\"},`reading the book \"Learning React\" was also very helpful, it helped provide\nsome mental structure`)),mdx(\"p\",null,\"Also stay patient, stay thankful, and try to focus while you learn\"),mdx(\"h2\",null,\"Introduction to me\"),mdx(\"p\",null,`I am maybe what you'd call a front-end engineer. I have done web development\nfor about 7 years now. I worked on various projects created with Ruby on Rails,\nPHP, Perl CGI, Java servlets, and client side JS. I am pretty steeped in the\n\"jquery spaghetti\" / mutable DOM everywhere era of things.`),mdx(\"h2\",null,\"My new job!\"),mdx(\"p\",null,`When I got a call about a new job in 2018, I was really happy and started in\nJune 2018. They decided they are going to do \"the big rewrite\" and are going to\nuse React.`),mdx(\"p\",null,`My coworker started building the new React app prototype. My coworker keeps\nasking me \"what state management library should we use\". I just had no idea\nabout React still, I had not ever looked into state management, and basically\njust was like \"I dunno!\". I had no way to form an opinion. I was also working\non some misc stuff sort of unrelated to the rewrite and remained pretty out of\nthe loop. We would have weekly meetings but I just wouldn't really understand\nthe goings ons. The project started using mobx-state-tree and I saw them start\nto write fresh code for the project but things like prop-types just were\nconfusing to me, e.g. there were the mobx-state-tree model types, and suddenly\nand the React prop-types and it was still the days of class-based React\ncomponents. I couldn't get any clear idea of what was happening`),mdx(\"h2\",null,\"I am floundering...not understanding what's going on with the rewrite\"),mdx(\"p\",null,`It's December 2018, I go home for Christmas and I have an honest talk with my\nparents and tell them\\xA0\"I don't get what is happening in the new codebase, I'm\nhonestly unhappy, and it just does all this\\xA0'React' stuff\" but I can't explain\nReact to them I just say the code is automatically reacting to other things. My\nparents say \"well if you are unhappy you might have to leave your job\" and they\nare not like, cheering for me to leave, but they tell me that. At this point,\nit really hit me that I do like this job and I decided to try to focus on work.`),mdx(\"h2\",null,\"I try and make an honest attempt to get involved in the project\"),mdx(\"p\",null,`On January 10th 2019, I make my first commit to the rewrite by doing some\nmonkey-see monkey-do type coding. I copy a bunch of files and just put them in\nthe right place, tweak some lines, and start to figure out how to make things\nrun. By the end of January 2019 I get my first code change merged.`),mdx(\"p\",null,\"I also suggested that we start doing \",mdx(\"strong\",{parentName:\"p\"},\"pair-programming sessions\"),`. Once I\nstarted these it made a huge difference for me in learning how to code. The\npair programming often still way over my head due to how my coworker presented\nstuff or how much he assumed I understood. Nevertheless, these were extremely\nhelpful for me to help get caught up.`),mdx(\"h2\",null,'Reading \"Learning React\"'),mdx(\"p\",null,`In March 2019, I got the book \"Learning React\" (O'Reilly2017\n`,mdx(\"a\",o({parentName:\"p\"},{href:\"https://www.oreilly.com/library/view/learning-react/9781491954614/\"}),\"https://www.oreilly.com/library/view/learning-react/9781491954614/\"),`) for my\nkindle.\\xA0 Reading this book was a big help I felt, and provided a needed \"brain\nreset\" for me. The book worked well for me, I read it each night on my kindle,\nand the function component concepts were super enlightening. To me it was so\nmuch better reading a book than, say, an internet tutorial. With the book, I\ncould focus, not have distractions, etc. My eyes would just glaze over every\ntime I clicked on internet tutorials and stuff before this.`),mdx(\"p\",null,`So anyways, March 2019 goes on, and I'm learning, but our codebase still feels\npretty complicated and alien. We use mobx-state-tree and the glue for\nmobx-state-tree to React e.g. the mobx-react doesn't really make sense to me. I\nremember asking my coworkers why my component was not updating and they\neventually find out it's because I keep not using the observe() wrapper around\nmy components.`),mdx(\"h2\",null,\"Trying out Typescript\"),mdx(\"p\",null,`In April 2019, I start to experiment with Typescript and release a Typescript\nversion of some data parsing code. I start by explicity specifying a lot of\ntypes but I eventually start getting\\xA0into the zen of \"type inference\" and I\nturn off the @typescript-eslint/explicit-function-return-type so I get implied\nreturn types.`),mdx(\"h2\",null,\"Using React hooks\"),mdx(\"p\",null,`In May 2019 I try out my first React hook, a useState. It worked well. I\ncouldn't really figure out why I would use it instead of the mobx state\nmanagement we used elsewhere, but the example was that it was a click and drag\nand it made sense to keep that click and drag state local to the component\nrather than the\\xA0\"app\". The book \"Learning React\" also helped me to understand\nhooks but only indirectly...it helped me understand function components vs\nclass components, and now, we all just write only function components with\nhooks and rarely see class components.`),mdx(\"h2\",null,\"Using react-testing-library\"),mdx(\"p\",null,`In June 2019, I create \"integration test\" level tests for our app. I had used\nreact-testing-library for some components before this, but this was using\nreact-testing-library to render the entire \"app level\" component. I was happy\nto pioneer this and was happy to try this out instead of doing true browser\ntests, and I think this has worked out well.`),mdx(\"p\",null,`Some caveats: I got very caught up with trying to do canvas tests initially. I\nreally wanted to use jest-mock-canvas but we were using offscreencanvas via a\npretty complicated string of things, so I don't make progress here, and I also\ngot confused about the relationship between node-canvas and jest-mock-canvas\n(they are basically totally different approaches). Later on, I find using\njest-image-snapshot of the canvas contents works nice (ref\n`,mdx(\"a\",o({parentName:\"p\"},{href:\"https://stackoverflow.com/questions/33269093/how-to-add-canvas-support-to-my-tests-in-jest\"}),\"https://stackoverflow.com/questions/33269093/how-to-add-canvas-support-to-my-tests-in-jest\"),\")\"),mdx(\"p\",null,`Other random note: when building out the integration tests, we got a lot\nof\\xA0\"act warnings\" which were confusing. These were fixed in React 16.9\n(released August 2019), but we had to ignore them and they basically just\nconfused me a lot and made it feel like I was battling a very complex system\nrather than a nice simple one.`),mdx(\"h2\",null,\"Conclusions\"),mdx(\"p\",null,`Overall, I just wanted to write up my whole experience. It felt really\ndifficult for me to make these changes. I also went through a breakup during\nthis time, had a bad living situation, etc. so things were a struggle. If\nanyone else has had struggles learning React, tell your story, and let me know.\nI'd like to also thank everyone who helped me along the way. I feel like a much\nbetter coder now, yet, I should always keep growing. The feeling of\nuncomfortableness could be a growing experience.`),mdx(\"h2\",null,\"Footnote\"),mdx(\"p\",null,`I also had tried using React in 2016... but it was unsuccessful, but maybe for\ninteresting reasons?`),mdx(\"p\",null,`I was tasked with making a normal form with text input elements, and I wanted\nto code and wanted to try using React. I tried importing React via a CDN\\xA0 and\ngave it a shot, and it seemed simple enough, but I kept getting really confused\nabout how to even read and initialize the value of a textbox for example\nproperly. TLDR: I was not aware of what a `,mdx(\"em\",{parentName:\"p\"},\"controlled component\"),\" was.\"),mdx(\"p\",null,`The idea of controlled components (not a word in my vocabulary at the time) was\nquite unintuitive and instead, I kept googling weird things like \"two way data\nbinding react\" and variants of this. I had never used Angular but I heard of\ntwo-way data binding from Angular, and I just felt like it was what I needed. I\neven posted about my frustrations about this on the React subreddit and was\ndownvoted. Felt bad. I was just really confused. I abandoned the project in\nReact and just used our normal jqueryish thing.`))}MDXContent.isMDXComponent=!0;\n","scope":{}}}},"__N_SSG":true}