{"pageProps":{"post":{"title":"How I learned to hate ORM (especially for data import scripts)","date":"2017-03-12","slug":"2017-03-12","content":"<p>When I was tasked with making a new application for our websites, I was\ngiven several CSV files with some expectation that these files could\nbasically be just loaded into a database and jumped into production really\nquickly. If you are using R and Shiny to make a data visualization dashboard,\nespecially if it is read only, this can actually be a reality for you: load\nthose CSVs and just pretend you're a full featured database. I had to actually\ncreate some read write functionality though. This was sort of experimental for\nme and I'm not that well versed in databases, but I wanted to share my\nexperience</p>\n<p>When I started, I chose grails/groovy/hibernate/GORM as a platform to\nuse. This quickly turned into pain when I tried to make a data importer\nusing grails also.</p>\n<p>Each CSV row from the source file would have to be turned into many\ndifferent rows in the database because it represented multiple\nrelationships, example:</p>\n<p><img src=\"/media/158300473458_0.png\" alt=\"\"></p>\n<p>Initially I made my data importer in grails, and was hardcoding column\nnames knowing full well this was really inflexible. At the same time I\nwas also trying to \"iterate\" on my database schema, and I'd want to\nre-import my data to test it out, but it was really really slow. I tried\nmany different approaches to try to speed this up such as cleanUpGorm,\nStatelessSessions, and other tricks, but it would take 10-20 minutes for\nimports on a 100KB input file.</p>\n<p>What I basically realised is that for bulk data import</p>\n<p><strong>1) Using the ORM is really painful for bulk import.</strong></p>\n<p><strong>2) If you can pre-process your data so that it is already in the\nformat the database expects, then you can use the CSV COPY command which\nis very fast</strong></p>\n<p><strong>3) If you can then abandon the ORM mentality and even ignore it as\na convenience factor, then you can embrace my database system itself</strong></p>\n<p>Overall, after all this work, it just seemed like ORM treats the\ndatabase as a danger and something to be heavily abstracted over, but I\nactually found joy in learning how to treat my database as a first class\ncitizen. Soon I started gaining appreciation of</p>\n<ul>\n<li>using plain SQL queries</li>\n<li>learning about full text search in postgres with ts_query</li>\n<li>learning about triggers to make a \"last updated\" field get updated\nautomatically</li>\n</ul>\n<p>I am pretty happy this way, and although I miss some things like\ncriteria queries which are very powerful, I am happy that I can interact\nwith my database as a friend</p>\n<p>At the very least, due to the fact that I now pre-process the data\nbefore database loading, I can now import large amounts of data super\nfast with the CSV COPY command</p>\n"}},"__N_SSG":true}