{"pageProps":{"post":{"title":"Cheating in your computer science class by copying from stackoverflow","date":"2015-12-17","slug":"2015-12-17","mdxSource":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    pre: \"pre\",\n    code: \"code\",\n    blockquote: \"blockquote\",\n    img: \"img\",\n    a: \"a\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"I would like to tell a story about how I provided some personal tutoring help\\nfor a friend in a computer science class, and talk about a nagging feeling that\\nreally felt wrong for me.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So, a long time ago, in a land far far away, a friend took an intermediate\\nclass on C++. I was first updated on his progress when he emailed me to get\\nsome help with some compiler errors. I was happy to help the young padawan.\\nHere was the error:\"\n    }), \"\\n\", _jsx(_components.pre, {\n      children: _jsx(_components.code, {\n        children: \"         test.cpp:42:43: error: non-ASCII characters are not allowed outside of literals\\n                and identifiers\\n              for (startScan = 0; startScan < (size − 1); startScan++)\\n                                                    ^~\\n\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Now, what does this say to you? For me, it was actually very clear what the\\nerror meant. It simply meant that this code was taken from somewhere, and\\ncopied and pasted into the compiler. I know that because if they had typed it\\nthemself, they definitely would not get this error, because it is the error\\nthat implies something was automatically converted to a unicode dash, mostly\\nsomething done during copying and pasting. At this point, I just kind of\\nlaughed, and helped him fix that. I showed how the compiler is actually pretty\\nsmart and can help fix these errors and then I said \\\"l8r dude\\\".\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"The next week, I had another skype meeting with him, and this time I wanted to\\nhelp a little more. It was pretty clear when we started that he was using code\\nthat was copied and pasted again. I said, \\\"uh, ok,....I'm not sure we need that\\nnow, but let's just keep going\\\", and then I sat down and started helping. I\\nwanted to help get all the details of the program working, so I helped guide\\nthe solution. Each time we needed to test the program, it required repeating\\nsome input lines via \", _jsx(_components.code, {\n        children: \"cin >>\"\n      }), \", which is really annoying (obviously, you should\\ntest your code with unit tests, but universities don't teach that, a rant for\\nanother day). Anyways, it took awhile, because coding really does just take\\ntime, but in the end he finally got it fixed and I said great job, and he\\nturned it in!\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Now, on my friends last assignment, I got another call for help, and when we\\nstarted skype, I found yet again that he had copied code from somewhere, which\\nincluded a C++ class and a main function for doing binary trees. I just simply\\nsaid \\\"dude, delete that, we don't need it\\\" and so he deleted it, but I think\\nmaybe he had worked on this copied code for awhile, and maybe felt it was kind\\nof his, so was apprehensive. I insisted though. Then we walked through the\\nassignment again, very slowly. I spent probably 2-3 hours helping him out that\\nnight. During those hours, I saw him continually making many programming\\nmistakes such as just not knowing how to declare variable or a function\\nproperly, or just not knowing what to do next. This was kind of frustrating!!!\\nBut I wanted to absolutely teach him how to make it right! I was patient\\nthough, and I wanted to teach a fun lesson, so I showed how you can do some\\n\\\"unit tests\\\" which avoids having to constantly re-enter your data via `cin\"\n    }), \"\\n\", _jsxs(_components.blockquote, {\n      children: [\"\\n\", _jsxs(_components.blockquote, {\n        children: [\"\\n\", _jsx(_components.p, {\n          children: \"`....\"\n        }), \"\\n\"]\n      }), \"\\n\"]\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"Now, the padawan completed his C++ class, and then we all were happy ever\\nafter....but a disturbance in the force was sensed...\\n\", _jsx(_components.img, {\n        src: \"http://zelcs.com/wp-content/uploads/2013/02/stackoverflow-logo-dumpster.jpg\",\n        alt: \"image\"\n      }), \"\\nImage from http://zelcs.com/this-is-why-stackoverflow-sucks/\"]\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"I was reminded about all this due to seeing that \", _jsx(_components.a, {\n        href: \"http://meta.stackexchange.com/questions/271080/the-mit-license-clarity-on-using-code-on-stack-overflow-and-on-the-stack-excha\",\n        children: \"StackOverflow is now changing\\ntheir \\\"license\\\" over all the little snippets of\\ncode\"\n      }), \"\\nthat are posted on their site. It just makes me reflect on literally HOW OFTEN\\nPEOPLE JUST COPY AND PASTE FROM THERE. They might understand what they are\\ndoing, or they seriously might not!!! I think it is a real problem that people\\nsometimes do not understand, but I cannot deny that it can be helpful too.\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"If I reflect on education in general, I recall when I took a University level\\nphysics class... it was really hard! We had to enter our validated solutions\\nfor the math problems into a computerized website homework portal, and that\\ninvolved being 100% correct about things. Now, what if there was just a\\nphysicsoverflow, where they not only had Q&A, but they had \\\"programs\\\" that gave\\nyou all the right answers to your homework problems that you could just copy\\nand paste and use as solutions to your homework? This isn't even in the realm\\nof asking for \\\"homework help\\\" anymore, this is just pure cheating if you can\\ncopy your answers from somewhere. It is disappointing though because this is\\nwhat people are doing in computer science!! These students are missing out on\\nbasic understanding of code. !!thisIsNotOk();\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"Now, at least when I was being a tutor for my friend, I felt like my advice\\nhelped my friend learn some things, not just give answers. But what if I was\\nnot there? I guess there is a certain \\\"impersonal quality\\\" that makes asking\\nGoogle/StackOverflow for answers less like conventional \\\"cheating\\\", but that is\\nstill wrong. I think it would be good if more expert knowledge was available\\nfor all people, and not just copy and paste snippets. As a start, I thought\\nthat \", _jsx(_components.a, {\n        href: \"http://cacm.acm.org/magazines/2015/10/192385-life-after-moocs/fulltext\",\n        children: \"this post by Philip Compeau and Pavel\\nPevzner\"\n      }), \"\\n(who teach a Bioinformatics Algorithms MOOC on Coursera) was very interesting,\\nand I really liked their quote:\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"\\\"Online education should move toward replicating the experience of receiving\\none-on-one tutoring.\\\"\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"That sounds great, but how can this be acheived? And how can it be done right?\\nI think it really requires the student to \\\"learn how to learn\\\"\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"If I think back to a long time ago, I remember being in 4th or 5th grade and I\\ndid a book report on World War 1, and I went to the library. I remember\\ndesperately flipping through pages of a 100 page book to try to find some\\nsnippets of information to support some basic idea that I wanted to talk about.\\nMaybe I wanted to know something specific, but the problem was that I wasn't\\nREALLY READING THE BOOK! I probably could have had a better understanding of\\nthe topic if I had just read it, or even a part of it, and asked for help, but\\ninstead I just picked and chose snippets from the book to \\\"sound smart\\\". I am\\nvery guilty of this type of error in many instances throughout my school\\ncareer, so I am no saint! I even have a phrase to describe this style of\\nlearning...I call it \\\"predatory learning\\\" and it is probably the worst kind of\\nlearning style. Predatory learners often pick and choose from scraps of info,\\nbut they never get a full meal!\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}}}},"__N_SSG":true}