{"pageProps":{"post":{"title":"Do you understand your NPM dependencies?","date":"2021-07-27","slug":"2021-07-27-npm-dependencies","html":"<p>You are writing a library...or you are writing an app and you want to publish\nsome of the components of it as a library...</p>\n<p>Here are some questions in the form of comments</p>\n<ul>\n<li>\n<p>Did you realize that your yarn.lock will be ignored for anyone who installs\nyour libraries?</p>\n</li>\n<li>\n<p>Did you realize this means that your perfectly running test suite with your\nyarn.lock could be a failing case for consumers of your library unless you\ndon’t use semver strings like ^1.0.0 and just hardcode it to 1.0.0?</p>\n</li>\n<li>\n<p>Did you realize the default of ^1.0.0 automatically gets minor version bumps\nwhich are often fairly substantial changes, e.g. even breaking possibly?</p>\n</li>\n<li>\n<p>Did you know that larger libraries like @material-ui/core don’t like to bump\ntheir major version all the time for example so large changes are often made\nto the minor version?</p>\n</li>\n<li>\n<p>Did you know if you run <code>yarn upgrade</code>, it may update what is in your\nyarn.lock file but will not update what is in your package.json?</p>\n</li>\n<li>\n<p>Did you realize that this means that if you depend on the results of running\n<code>yarn upgrade</code> e.g. it gave you a bugfix, you could be shipping buggy code to\nconsumers of your library?</p>\n</li>\n</ul>\n<p>Just something to be aware of! You can always ride the dragon and accept these\nminor breakages from semver bumps, but it can introduce some issues for your\nconsumers</p>\n<p>Random fun thing: Adding a yarn package can even downgrade some other packages.\nFor example if you have ^6.0.0 in your package.json, you yarn upgrade it so in\nthe lockfile it says 6.1.0 but then later install another library that requires\na hard 6.0.1, yarn will decide to downgrade you to 6.0.1 (it will not have a\nduplicate entry in yarn.lock, just that the 6.1.0 in the yarn.lock will\ndowngrade to 6.0.1)</p>"}},"__N_SSG":true}