{"pageProps":{"post":{"title":"Creating a music player using Rust/GTK4 - fml9000","date":"2022-09-05","slug":"2022-09-05-rustmusicplayer","html":"<p>I have started endeavoring to learn Rust. I did the rustlings exercises but I\nknew the concepts would fade rapidly from my brain without some practice. I\nhave now started making a music player using Rust+GTK4.</p>\n<p>I chose GTK4 is to have a linux native GUI to scratch the itch that I've had in\nlacking foobar2000 on linux. I have a particular foobar2000 setup that uses\ndefault UI with four quadrants. I have used foobar2000 under wine and it's not\nterrible, but it has background CPU consumption of about 14% idle and is just a\nlittle \"off\". I have also used a variety of other GUI (quodlibet) and CLI\n(cmus) apps on linux, but they didn't really feel quite right.</p>\n<p>My first hurdle was getting started with GTK and Rust. I started by attempting\nwith Relm4, which I may return to at some point, but trying to juggle learning\nRelm4-style widgets, GTK, and rust all at once was a bit much. I stepped to\nusing gtk4-rs directly.</p>\n<p>Then, I wanted to create a data grid showing to display e.g. a table with\nartist, track, album, etc. I chose to use the\n<a href=\"https://docs.gtk.org/gtk4/class.ColumnView.html\">Gtk::ColumnView</a> to drive\nthis. There was no example code for this so I stuggled with this (for a couple\ndays) before realizing that the ListView example in the gtk4-rs codebase has\nsimilar concepts (factory to create grid cells, etc). I created a PR\n(<a href=\"https://github.com/gtk-rs/gtk4-rs/pull/1111\">https://github.com/gtk-rs/gtk4-rs/pull/1111</a>) to demonstrate simple ColumnView\nusage.</p>\n<p>After this hurdle was crossed, I felt much more comfortable in the GTK mindset.\nI would just search for various components and they often already existed which\nwas great. There was even one called Gtk::MediaFile which should to be able to\nplay e.g. mp3s, making my job of making a media player much simpler, but it\nproduced an error <a href=\"https://www.google.com/search?q=%22GTK+could+not+find+a+media+module.+Check+your+installation.%22&#x26;oq=%22GTK+could+not+find+a+media+module.+Check+your+installation.%22&#x26;aqs=chrome..69i57.267j0j7&#x26;sourceid=chrome&#x26;ie=UTF-8\">\"GTK could not find a media module. Check your\ninstallation.\"</a>\nwhich had very few references on the internet. So, I am trying out symphonia\n(<a href=\"https://github.com/pdeljanov/Symphonia/\">https://github.com/pdeljanov/Symphonia/</a>), with the hope being that it is\neasier to package these for consumers of the app.</p>\n<p>The current work is at <a href=\"https://github.com/cmdcolin/fml9000\">https://github.com/cmdcolin/fml9000</a></p>\n<p><img src=\"/media/fml9000_1.png\" alt=\"\"></p>\n<p>Some stuff in the screenshot is mocked and not fully functional, but it has\nbeen a great adventure</p>"}},"__N_SSG":true}