{"pageProps":{"post":{"title":"Basic command line productivity tricks and learning experiences","date":"2016-04-06","slug":"2016-04-06","html":"<ul>\n<li>dd deletes line in vim</li>\n<li>Ctrl+d scrolls down in vim</li>\n<li>Learn to love your package manager. Homebrew, NPM, gem, cpanm, gvm/sdkman,\netc. these all do amazing things</li>\n<li>Once you learn bash, try zsh and oh-my-zsh, they have things like\ncase-insensitive tab completion</li>\n<li>Don't make scripts that hardcode paths, make reusable command line scripts.\nUse bash as your \"REPL\", not R.</li>\n<li>git log -p helps analyze your log files in full details (make sure\nautocoloring is turned on in your terminal)</li>\n<li>There are keys to jump forward and backwards on the command line text editor,\nlearn them...don't scroll one char at a time</li>\n<li>Learn how \"PATH\" works. Generally it is just a set of directories connected by\n\":\" separators. You can add things to the path by saying \"export\nPATH=$PATH:/new/directory/to/add\" and you can add this to ~/.bashrc for\nexample</li>\n<li>When your install process for a command line tool seems like nonsense, try\nhomebrew instead. barring that, learn PATH, and how to run \"make install\",\netc. Most of your headbashing from installing programs is 90% can be explained\nby not understanding how the developer is intending it to be used, 10% of the\ntool's install process being wrong</li>\n<li>Get a static analyzer and basic tests going on your codebase and run it on\ntravis-ci. Getting started with travis-ci is kind of a learning curve, but it\nis worth it</li>\n<li>Use cpanm instead of cpan for package management</li>\n<li>Vocabulary learning curve: catalina is the same thing as tomcat. CATALINA_HOME\nis the same thing as the tomcat folder</li>\n<li>alias ll=\"ls -l\", because I type \"ll\" hundreds of times a day.</li>\n<li>For irc productivity, run irssi on a server in a \"screen\" e.g. \"screen irssi\"\nand then you can come back to conversations later by just logging into the\nserver with ssh</li>\n<li>Edit ~/.ssh/config to include your hostnames so you don't have to type out\nlong ssh commands\n<a href=\"http://nerderati.com/2011/03/17/simplify-your-life-with-an-ssh-config-file/\">http://nerderati.com/2011/03/17/simplify-your-life-with-an-ssh-config-file/</a></li>\n<li>Use spaces instead of tabs in your source code (>:( yes I think this is the\none true way)</li>\n<li>Try out nodejs and browserify in your spare time to make a \"npm\" based app in\nthe browser. it's fun.</li>\n<li>Similarly, try making a simple \"api\" endpoint on the server side with\nexpress.js or similar. can get started very quickly.</li>\n<li>Learn how to get a mindset of writing tests. You can write tests proactively\n(i.e. Test driven development), but you can also write them \"reactively\" too\n(i.e. if have a bug that you fix, you can make a test to make sure this\ndoesn't happen anymore)</li>\n<li>Similar to above, tests in this sense are more \"sanity checks\" than they are\nformal proofs. Take \"assert\" logic and \"debugging\" code out of main codebase\nand put them in tests</li>\n<li>Minimize comments in your code, and also don't comment out code and leave it\npresent. Find a way to delete it and move on!</li>\n<li>When you have a bunch of .orig files after doing a git merge, just use git\nclean -f to get rid of them. Similarly, to get rid of everythng, including\nthings in your gitignore file (i.e. a super clean) use git clean -fdx. It has\na --exclude argument too</li>\n</ul>"}},"__N_SSG":true}